In [ ]:
import pandas as pd

# Reading a CSV file into a DataFrame using Pandas

In [ ]:
employees_df = pd.read_csv('employees.csv')

# Dropping the first column (First Name)

In [ ]:
employees_df.drop(axis=1,columns="First Name", inplace=True)

In [ ]:
employees_df.head()

   Gender    Salary  Bonus %             Team
0    Male   97308.0    6.945        Marketing
1    Male   61933.0    4.170           Others
2  Female  130590.0   11.858          Finance
3    Male  138705.0    9.340          Finance
4    Male  101004.0    1.389  Client Services

# Filling in missing values in (Salary, Bonus %) using the mean value of each column

#### 1/ Salary

In [ ]:
employees_df["Salary"].fillna(value = employees_df["Salary"].mean(), inplace = True)

#### 2/ Bonus %

In [ ]:
employees_df["Bonus %"].fillna(value = employees_df["Bonus %"].mean(), inplace = True)

# Converting text values to numerical values in (Gender, Team)

#### 1/ Gender

In [ ]:
gender_in_Binary = {'Male':0, 'Female':1}

In [ ]:
employees_df.Gender = [gender_in_Binary[person] for person in employees_df.Gender]

In [ ]:
employees_df.head()

   Gender    Salary  Bonus %             Team
0       0   97308.0    6.945        Marketing
1       0   61933.0    4.170           Others
2       1  130590.0   11.858          Finance
3       0  138705.0    9.340          Finance
4       0  101004.0    1.389  Client Services

#### 2/ Team

###### Creating a dictionary for the mapping of the Team column

In [ ]:
set_of_teams = set(employees_df['Team'])
set_of_teams

{'Business Development',
 'Client Services',
 'Distribution',
 'Engineering',
 'Finance',
 'Human Resources',
 'Legal',
 'Marketing',
 'Others',
 'Product',
 'Sales'}

In [ ]:
set_of_team_indexes = set(range(0, len(set_of_teams)))
set_of_team_indexes

{0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10}

In [ ]:
team_dictionary = dict(zip(set_of_teams ,set_of_team_indexes))
team_dictionary

{'Business Development': 3,
 'Client Services': 8,
 'Distribution': 10,
 'Engineering': 0,
 'Finance': 7,
 'Human Resources': 6,
 'Legal': 5,
 'Marketing': 9,
 'Others': 4,
 'Product': 2,
 'Sales': 1}

In [ ]:
employees_df.Team = [team_dictionary[team] for team in employees_df.Team]

In [ ]:
employees_df

    Gender    Salary  Bonus %  Team
0        0   97308.0    6.945     9
1        0   61933.0    4.170     4
2        1  130590.0   11.858     7
3        0  138705.0    9.340     7
4        0  101004.0    1.389     8
..     ...       ...      ...   ...
94       0  130620.0    7.030     5
95       1   43026.0   14.166     8
96       1  142321.0    1.737     7
97       1  140371.0   10.620     9
98       1  100705.0   16.961     9

[99 rows x 4 columns]

#Saving the modified DataFrame to a CSV file

In [ ]:
employees_df.to_csv("exported_employees.csv", index=False)